Revit 2024 API
IFCAnyHandle.Id Property
 The integer identifier for the handle.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public int Id { get; }
Visual Basic
Public ReadOnly Property Id As Integer
	Get
Visual C++
public:
property int Id {
	int get ();
}
See Also
IFCAnyHandle Class
Autodesk.Revit.DB.IFC Namespace